{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Empty feature evidence report object.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend components and assets.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark mode color tokens and global styling.",
  "frontend/index.html": "Main HTML entry with SEO metadata, social tags, and AdSense script, loading the React app.",
  "frontend/public/robots.txt": "Allows all crawlers and links to sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing main Student Hub pages with priorities and change frequencies.",
  "frontend/src/App.tsx": "Root app component that renders the router.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "Ad container showing placeholder or a 728x90 banner depending on props.",
  "frontend/src/components/monetization/HighPerformanceBanner300x250.tsx": "Empty placeholder file for 300x250 ad component.",
  "frontend/src/components/monetization/HighPerformanceBanner728x90.tsx": "Injects HighPerformanceFormat ad scripts safely with cleanup on unmount.",
  "frontend/src/components/nav/StickyNavbar.tsx": "Sticky navbar with scroll detection, logo fallback, navigation links, and homepage section scrolling.",
  "frontend/src/components/roadmap/careerPaths.ts": "Defines the CareerPath interface and exports a large list of categorized career paths. Used for selection in the roadmap builder.",
  "frontend/src/components/roadmap/CareerPathSelector.tsx": "Searchable, grouped career path selector using popover and command components.",
  "frontend/src/components/roadmap/RoadmapBuilderForm.tsx": "Form component collecting career details and generating a roadmap using templates. Validates inputs and triggers roadmap creation via callback.",
  "frontend/src/components/roadmap/roadmapTemplates.ts": "Contains roadmap template data mapped by career categories and generates structured RoadmapData objects. Provides skills, tools, projects, strategies, plans, and salary ranges per category.",
  "frontend/src/components/roadmap/RoadmapTimeline.tsx": "Displays a generated roadmap with required skills, tools, projects, internship strategy, and monthly goals. Renders structured roadmap sections using cards and badges.",
  "frontend/src/components/sections/AcademicToolsSection.tsx": "Renders a grid of academic tools and opens calculators in a dialog via lazy-loaded components. Manages tool selection and displays corresponding calculators.",
  "frontend/src/components/sections/CareerRoadmapSection.tsx": "Wraps the roadmap builder and timeline, managing state for generated roadmap data. Provides layout and section heading for the AI roadmap feature.",
  "frontend/src/components/sections/DailyUtilitiesSection.tsx": "Displays four daily utility tools and opens each inside a dialog using state-based selection.",
  "frontend/src/components/sections/FooterSection.tsx": "Renders the site footer with about, contact, privacy links, ads, and copyright info.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with headline, CTA buttons, and an illustration, including smooth-scroll navigation.",
  "frontend/src/components/sections/ResumePlacementSection.tsx": "Shows resume and placement tools in a grid and opens the selected tool in a dialog.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Provides light, dark, and system theme management with persistence and context access.",
  "frontend/src/components/theme/ThemeToggleButton.tsx": "Button that switches between light and dark themes using ThemeProvider state.",
  "frontend/src/components/tools/academic/AttendanceCalculator.tsx": "Calculates attendance percentage and allowable bunk classes with validations and alerts.",
  "frontend/src/components/tools/academic/CgpaSgpaCalculator.tsx": "Lets users add subjects and computes CGPA and percentage from credits and grade points.",
  "frontend/src/components/tools/academic/MarksPredictor.tsx": "A tool that takes internal and expected exam marks, validates them, and displays the predicted final score.",
  "frontend/src/components/tools/academic/PercentageCalculator.tsx": "Calculates percentage from obtained and total marks with validation and error alerts.",
  "frontend/src/components/tools/resume/InternshipEmailTemplateGenerator.tsx": "Generates a customizable internship application email based on user inputs and allows copying the result.",
  "frontend/src/components/tools/resume/InterviewPrepChecklist.tsx": "Interactive interview preparation checklist with progress tracking and copy-to-clipboard support.",
  "frontend/src/components/tools/resume/LinkedInProfileChecklist.tsx": "Checklist for optimizing a LinkedIn profile with item tracking and copy-to-clipboard functionality.",
  "frontend/src/components/tools/resume/ResumeBulletGenerator.tsx": "Creates a resume bullet point from action, result, and optional impact inputs, with copy support.",
  "frontend/src/components/tools/utilities/AgeCalculator.tsx": "Computes age in years, months, and days based on a selected birthdate.",
  "frontend/src/components/tools/utilities/BmiCalculator.tsx": "Calculates BMI from height and weight and displays category with a badge.",
  "frontend/src/components/tools/utilities/EmiCalculator.tsx": "Interactive EMI calculator component computing EMI, total amount, and interest from user inputs.",
  "frontend/src/components/tools/utilities/UnitConverter.tsx": "Unit converter supporting length, weight, and temperature conversions with dynamic unit selection.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a Dfinity backend actor tied to the user's identity with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider handling Internet Identity auth flow, identity storage, and login state management.",
  "frontend/src/index.css": "Tailwind CSS base setup with custom theme variables, dark mode styles, and utility classes.",
  "frontend/src/lib/clipboard.ts": "Utility function to copy text to clipboard with modern and fallback implementations.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/pages/HomePage.tsx": "Homepage assembling main sections, ads, and SEO schemas for the Student Hub site.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Privacy policy page explaining data usage practices with structured sections and icons.",
  "frontend/src/pages/tools/AgeCalculatorPage.tsx": "Lazy-loaded age calculator tool page rendered within a shared ToolPageLayout with SEO content.",
  "frontend/src/pages/tools/AttendanceCalculatorPage.tsx": "Loads the attendance calculator tool inside a shared ToolPageLayout with SEO content and FAQs.",
  "frontend/src/pages/tools/BmiCalculatorPage.tsx": "Renders the BMI calculator tool within ToolPageLayout using lazy‑loaded component and SEO data.",
  "frontend/src/pages/tools/CareerRoadmapGeneratorPage.tsx": "Manages roadmap form state and displays the generated roadmap timeline within ToolPageLayout.",
  "frontend/src/pages/tools/CgpaCalculatorPage.tsx": "Loads the CGPA/SGPA calculator component and wraps it with ToolPageLayout and related SEO content.",
  "frontend/src/pages/tools/EmiCalculatorPage.tsx": "Displays the EMI calculator tool using lazy loading and ToolPageLayout for SEO content and FAQs.",
  "frontend/src/pages/tools/InternshipEmailTemplatePage.tsx": "Provides the internship email template generator inside ToolPageLayout with content and FAQs.",
  "frontend/src/pages/tools/InterviewPrepChecklistPage.tsx": "Shows the interview preparation checklist tool using ToolPageLayout and SEO sections.",
  "frontend/src/pages/tools/LinkedinProfileChecklistPage.tsx": "Renders a LinkedIn profile optimization checklist within ToolPageLayout and SEO data.",
  "frontend/src/pages/tools/ResumeBulletGeneratorPage.tsx": "Loads the resume bullet generator tool inside ToolPageLayout with content and FAQs.",
  "frontend/src/pages/tools/SgpaCalculatorPage.tsx": "Uses the CGPA/SGPA calculator component to compute SGPA within ToolPageLayout.",
  "frontend/src/pages/tools/ToolPageLayout.tsx": "Shared layout for tool pages adding title, description, structured data, content sections, and FAQs.",
  "frontend/src/pages/tools/UnitConverterPage.tsx": "Renders the unit converter tool using lazy loading inside ToolPageLayout.",
  "frontend/src/routes/Router.tsx": "Defines the app's router, lazy‑loads tool pages, and wraps routes in a themed root layout.",
  "frontend/src/seo/content/age.ts": "Provides age calculator content sections and FAQ entries for SEO and page rendering.",
  "frontend/src/seo/content/attendance.ts": "Provides SEO content explaining attendance percentage, calculation steps, university rules, and tips for maintaining required attendance.",
  "frontend/src/seo/content/bmi.ts": "Contains BMI-related SEO content covering BMI meaning, calculation, limitations, and FAQs for students.",
  "frontend/src/seo/content/careerRoadmap.ts": "Includes SEO text describing career roadmaps, how to use the AI generator, and popular engineering career paths.",
  "frontend/src/seo/content/cgpa.ts": "Offers SEO content on CGPA definition, calculation formulas, step-by-step guidance, and percentage conversion methods.",
  "frontend/src/seo/content/emi.ts": "Provides EMI-related SEO content explaining EMI basics, formulas, education loan details, repayment tips, and FAQs.",
  "frontend/src/seo/content/internshipEmail.ts": "Provides guidance and templates for writing effective cold emails for internships, covering structure, personalization, and finding company contacts.",
  "frontend/src/seo/content/interviewPrep.ts": "Contains interview preparation guidance for technical and behavioral rounds, offering checklists, study areas, and interview-day tips.",
  "frontend/src/seo/content/linkedinChecklist.ts": "Offers a detailed checklist for optimizing LinkedIn profiles, covering sections like photo, headline, about, skills, endorsements, and recommendations.",
  "frontend/src/seo/content/resumeBullets.ts": "Explains how to write strong resume bullet points using action verbs, metrics, and the STAR method, with examples and section-specific advice.",
  "frontend/src/seo/content/sgpa.ts": "Defines SGPA-related interfaces and provides explanations, formulas, and steps for calculating SGPA and converting it to percentage.",
  "frontend/src/seo/content/unitConverter.ts": "Provides SEO content sections and FAQs for the unit converter tool, including explanations of unit categories, common conversions, and student use cases.",
  "frontend/src/seo/HeadTags.tsx": "Updates document head metadata dynamically based on the current route's SEO settings.",
  "frontend/src/seo/jsonld.ts": "Generates JSON-LD schemas for web applications, breadcrumbs, and FAQ pages using provided metadata.",
  "frontend/src/seo/seoRoutes.ts": "Defines SEO metadata for each route, including titles, descriptions, keywords, and canonical paths for all major site tools.",
  "frontend/src/seo/siteConfig.ts": "Exports base site URL resolver and global SEO site configuration such as name, description, keywords, and social metadata.",
  "frontend/src/seo/StructuredData.tsx": "Injects JSON‑LD structured data scripts into the page for SEO.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme settings, colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks overall project state, goals, constraints, known issues, and existing features for the Student Hub static website."
}