{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing feature requirements, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files for reference.",
  "frontend/index.css": "Tailwind CSS base/theme variables and global styles for light and dark modes.",
  "frontend/index.html": "Main HTML entry with SEO metadata, OG/Twitter tags, and AdSense script.",
  "frontend/public/robots.txt": "Robots file allowing all crawlers and pointing to sitemap.",
  "frontend/public/sitemap.xml": "XML sitemap listing tool and page URLs with priorities and changefreq.",
  "frontend/src/App.tsx": "App component rendering the Router.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "Reusable ad placeholder that displays either blank space or a 728x90 banner.",
  "frontend/src/components/monetization/HighPerformanceBanner300x250.tsx": "Empty component file placeholder for 300x250 banner.",
  "frontend/src/components/monetization/HighPerformanceBanner728x90.tsx": "Component that injects a HighPerformanceFormat 728x90 ad script safely with cleanup.",
  "frontend/src/components/nav/StickyNavbar.tsx": "Responsive sticky navbar with scroll detection, homepage section scrolling, and logo fallback behavior.",
  "frontend/src/components/roadmap/careerPaths.ts": "Defines career path metadata, categories, and the base list of available careers.",
  "frontend/src/components/roadmap/CareerPathSelector.tsx": "Dropdown component for selecting and filtering career paths by category and search query using popover and command UI.",
  "frontend/src/components/roadmap/RoadmapBuilderForm.tsx": "Form to collect career, year, skills, and study hours before generating a personalized roadmap.",
  "frontend/src/components/roadmap/roadmapTemplates.ts": "Provides roadmap data structures and predefined templates for generating career roadmaps.",
  "frontend/src/components/roadmap/RoadmapTimeline.tsx": "Displays a generated roadmap with career summary and structured learning phases.",
  "frontend/src/components/sections/AcademicToolsSection.tsx": "UI section listing academic tools and opening calculators via lazy-loaded dialogs.",
  "frontend/src/components/sections/CareerRoadmapSection.tsx": "Renders a career roadmap section with a form to generate roadmap data and a timeline preview when data is available.",
  "frontend/src/components/sections/DailyUtilitiesSection.tsx": "Displays a grid of daily utility tools and opens each tool in a modal dialog when selected.",
  "frontend/src/components/sections/FooterSection.tsx": "Provides the site footer with about info, contact links, privacy policy, and an ad placeholder.",
  "frontend/src/components/sections/HeroSection.tsx": "Creates the hero banner with main headlines, action buttons, and an illustration, including smooth scrolling to sections.",
  "frontend/src/components/sections/ResumePlacementSection.tsx": "Shows resume and placement tools, including an ATS resume generator link and modal-based tools for resume and interview help.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Implements a theme context managing light, dark, and system themes with persistence and system preference handling.",
  "frontend/src/components/theme/ThemeToggleButton.tsx": "Provides a button to toggle between light and dark themes using the theme context.",
  "frontend/src/components/tools/academic/AttendanceCalculator.tsx": "A calculator that computes attendance percentage and how many classes can be missed while maintaining 75% attendance.",
  "frontend/src/components/tools/academic/CgpaSgpaCalculator.tsx": "Interactive CGPA/percentage calculator that lets users add subjects with credits and grades and computes totals dynamically.",
  "frontend/src/components/tools/academic/MarksPredictor.tsx": "Simple calculator that sums internal and expected exam marks and displays the predicted final score.",
  "frontend/src/components/tools/academic/PercentageCalculator.tsx": "Percentage calculator validating marks input and showing errors when inputs are invalid.",
  "frontend/src/components/tools/resume/AtsResumeGenerator.tsx": "Multi‑step ATS-friendly resume builder allowing users to input profile details, experiences, education, and projects to generate formatted text.",
  "frontend/src/components/tools/resume/InternshipEmailTemplateGenerator.tsx": "Generates a customizable internship application email and allows copying the result.",
  "frontend/src/components/tools/resume/InterviewPrepChecklist.tsx": "Interactive interview preparation checklist with progress tracking and copy-to-clipboard support.",
  "frontend/src/components/tools/resume/LinkedInProfileChecklist.tsx": "LinkedIn profile optimization checklist with item tracking and clipboard export.",
  "frontend/src/components/tools/resume/ResumeBulletGenerator.tsx": "Generates a resume bullet point from user-provided action, result, and optional impact, with copy-to-clipboard support.",
  "frontend/src/components/tools/utilities/AgeCalculator.tsx": "Calculates age in years, months, and days from a selected birthdate and displays the results.",
  "frontend/src/components/tools/utilities/BmiCalculator.tsx": "Computes BMI from height and weight inputs and shows the numeric result with a category badge.",
  "frontend/src/components/tools/utilities/EmiCalculator.tsx": "Calculates loan EMI, total amount, and total interest based on principal, rate, and tenure inputs.",
  "frontend/src/components/tools/utilities/UnitConverter.tsx": "Converts values across length, weight, and temperature units using configurable dropdowns.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, auto-invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, theming variables, dark mode rules, and utility classes for transitions and branding.",
  "frontend/src/lib/clipboard.ts": "Utility that copies text to the clipboard using the modern API or a textarea fallback.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage layout with hero, tool sections, ads, and SEO schemas.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the privacy policy with styled sections explaining data practices.",
  "frontend/src/pages/tools/AgeCalculatorPage.tsx": "Sets up the age calculator tool page using ToolPageLayout with lazy-loaded component and SEO content.",
  "frontend/src/pages/tools/AtsResumeGeneratorPage.tsx": "Configures the ATS resume generator page with its tool component and SEO sections.",
  "frontend/src/pages/tools/AttendanceCalculatorPage.tsx": "Defines the attendance calculator page with lazy-loaded tool and structured content.",
  "frontend/src/pages/tools/BmiCalculatorPage.tsx": "Provides the BMI calculator page setup with lazy-loaded component and SEO metadata.",
  "frontend/src/pages/tools/CareerRoadmapGeneratorPage.tsx": "Implements the AI career roadmap generator page with form, generated roadmap display, and SEO content.",
  "frontend/src/pages/tools/CgpaCalculatorPage.tsx": "Configures the CGPA calculator page using the shared SGPA/CGPA component and related SEO content.",
  "frontend/src/pages/tools/EmiCalculatorPage.tsx": "Creates the EMI calculator tool page with lazy-loaded component and SEO sections.",
  "frontend/src/pages/tools/InternshipEmailTemplatePage.tsx": "Sets up the internship email template generator page with tool component and metadata.",
  "frontend/src/pages/tools/InterviewPrepChecklistPage.tsx": "Defines the interview preparation checklist page with its lazy-loaded tool and SEO content.",
  "frontend/src/pages/tools/LinkedinProfileChecklistPage.tsx": "Renders the LinkedIn profile checklist tool page with SEO metadata.",
  "frontend/src/pages/tools/ResumeBulletGeneratorPage.tsx": "Creates the resume bullet generator page using ToolPageLayout and lazy-loaded component.",
  "frontend/src/pages/tools/SgpaCalculatorPage.tsx": "Provides the SGPA calculator page using the shared calculator component and related SEO content.",
  "frontend/src/pages/tools/ToolPageLayout.tsx": "Shared layout for all tool pages, handling SEO schemas, headings, tool rendering, and FAQ content.",
  "frontend/src/pages/tools/UnitConverterPage.tsx": "Sets up the unit converter tool page with lazy-loaded component and SEO sections.",
  "frontend/src/routes/Router.tsx": "Defines the app’s main router with lazy‑loaded pages and a root layout including navbar, footer, SEO tags, and toaster.",
  "frontend/src/seo/content/age.ts": "Provides structured content and FAQs describing the age calculator, its uses, and manual calculation steps.",
  "frontend/src/seo/content/atsResume.ts": "Contains content and FAQs explaining ATS-friendly resumes, their importance, and how to use the resume generator.",
  "frontend/src/seo/content/attendance.ts": "Provides detailed content about attendance calculation, university rules, and usage of the attendance calculator.",
  "frontend/src/seo/content/bmi.ts": "Supplies explanation, calculation steps, limitations, and FAQs for the BMI calculator.",
  "frontend/src/seo/content/careerRoadmap.ts": "Provides detailed content sections explaining career roadmaps, how to use the AI roadmap generator, and popular engineering career paths.",
  "frontend/src/seo/content/cgpa.ts": "Explains CGPA, its calculation methods, step‑by‑step computation, and conversion formulas used by Indian universities.",
  "frontend/src/seo/content/emi.ts": "Covers EMI basics, calculation formulas, education loan details, strategies to reduce EMI burden, and related FAQs.",
  "frontend/src/seo/content/internshipEmail.ts": "Describes why cold emails work for internships, how to write effective ones, and how to find companies and contacts.",
  "frontend/src/seo/content/interviewPrep.ts": "Outlines complete interview preparation including technical, behavioral, and interview‑day guidance for students.",
  "frontend/src/seo/content/linkedinChecklist.ts": "Provides content sections for a LinkedIn profile optimization checklist targeted at students, covering profile sections, skills, endorsements, and recommendations.",
  "frontend/src/seo/content/resumeBullets.ts": "Defines content for resume bullet point guidance, including best practices, examples, and tips for projects, internships, and achievements.",
  "frontend/src/seo/content/sgpa.ts": "Exports SGPA-related content sections explaining SGPA, its formula, calculation steps, and conversion to percentage.",
  "frontend/src/seo/content/unitConverter.ts": "Contains content explaining the unit converter tool, common conversions, importance of unit conversion, and related FAQs.",
  "frontend/src/seo/HeadTags.tsx": "Updates document head tags dynamically based on route-specific SEO config, including meta, Open Graph, Twitter, and canonical tags.",
  "frontend/src/seo/jsonld.ts": "Utility functions generating JSON-LD schemas for web applications, breadcrumbs, and FAQ pages.",
  "frontend/src/seo/seoRoutes.ts": "Defines SEO route metadata including titles, descriptions, keywords, and canonical paths for various site pages.",
  "frontend/src/seo/siteConfig.ts": "Provides site-wide SEO configuration and a function returning the base URL depending on environment.",
  "frontend/src/seo/StructuredData.tsx": "Renders one or more JSON-LD structured data scripts in the page head.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme tokens, custom animations, and typography/container/animation plugins.",
  "project_state.json": "Defines project state, goals, constraints, existing features, and known issues for the static Student Hub website."
}