{
  "backend/main.mo": "Empty Motoko actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report mapping privacy‑policy related features to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of multiple frontend files and components.",
  "frontend/index.css": "Tailwind CSS base configuration defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Main HTML entry point defining metadata, SEO tags, and loading the React app with AdSense script.",
  "frontend/public/robots.txt": "Robots.txt allowing full crawling and pointing to sitemap.xml.",
  "frontend/public/sitemap.xml": "Static sitemap listing site routes including /privacy-policy for search engine discovery.",
  "frontend/src/App.tsx": "Thin wrapper component that renders the Router.",
  "frontend/src/components/monetization/AdPlaceholder.tsx": "UI placeholder component rendering styled empty ad blocks for different page locations.",
  "frontend/src/components/nav/StickyNavbar.tsx": "Sticky navigation bar with scroll‑aware styling, logo handling, and section‑scroll navigation.",
  "frontend/src/components/roadmap/careerPaths.ts": "Exports a large list of categorized career paths used for selection in the roadmap builder.",
  "frontend/src/components/roadmap/CareerPathSelector.tsx": "Career path dropdown with searchable, grouped options using Command and Popover components.",
  "frontend/src/components/roadmap/RoadmapBuilderForm.tsx": "Form component that collects career, year, skills, and study hours to generate a roadmap using getRoadmapTemplate and triggers onGenerate.",
  "frontend/src/components/roadmap/roadmapTemplates.ts": "Defines roadmap data structures and provides templates per career category to generate a RoadmapData object.",
  "frontend/src/components/roadmap/RoadmapTimeline.tsx": "Displays the generated roadmap with sections for skills, tools, projects, internship strategy, and monthly plans.",
  "frontend/src/components/sections/AcademicToolsSection.tsx": "Renders academic tool cards and opens calculators in a dialog using lazy-loaded components.",
  "frontend/src/components/sections/CareerRoadmapSection.tsx": "Wraps the roadmap builder and timeline, storing and displaying generated roadmap data.",
  "frontend/src/components/sections/DailyUtilitiesSection.tsx": "Renders a grid of daily utility tools and opens the selected tool inside a dialog. Includes age, EMI, BMI, and unit conversion calculators.",
  "frontend/src/components/sections/FooterSection.tsx": "Displays the site footer with about info, contact links, privacy policy, and a dynamic year plus an ad section.",
  "frontend/src/components/sections/HeroSection.tsx": "Provides the homepage hero section with a headline, CTAs that scroll to sections, and a large illustration.",
  "frontend/src/components/sections/ResumePlacementSection.tsx": "Shows resume and placement tools in a grid and loads each tool in a dialog on click. Includes resume bullets, email templates, interview prep, and LinkedIn checklist.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Offers a theme context managing light, dark, and system themes, storing preferences and reacting to system theme changes.",
  "frontend/src/components/theme/ThemeToggleButton.tsx": "Button that toggles between light and dark themes using the theme context.",
  "frontend/src/components/tools/academic/AttendanceCalculator.tsx": "Calculates attendance percentage and possible bunkable classes based on total and attended classes, showing alerts for validity and results.",
  "frontend/src/components/tools/academic/CgpaSgpaCalculator.tsx": "Allows users to enter subjects with credits and grades to compute CGPA and percentage, with dynamic subject management.",
  "frontend/src/components/tools/academic/MarksPredictor.tsx": "Simple tool that takes internal and exam marks and displays their sum as a predicted final score.",
  "frontend/src/components/tools/academic/PercentageCalculator.tsx": "Calculates percentage from obtained and total marks with basic validation and error alerts.",
  "frontend/src/components/tools/resume/InternshipEmailTemplateGenerator.tsx": "Generates a customizable internship application email based on user inputs and allows copying it.",
  "frontend/src/components/tools/resume/InterviewPrepChecklist.tsx": "Interactive interview preparation checklist with progress tracking and copy-to-clipboard export.",
  "frontend/src/components/tools/resume/LinkedInProfileChecklist.tsx": "Checklist for optimizing a LinkedIn profile with progress tracking and copy-to-clipboard support.",
  "frontend/src/components/tools/resume/ResumeBulletGenerator.tsx": "Creates resume bullet points from action, result, and optional impact inputs, with copy functionality.",
  "frontend/src/components/tools/utilities/AgeCalculator.tsx": "Computes age in years, months, and days from a selected birthdate and displays the breakdown.",
  "frontend/src/components/tools/utilities/BmiCalculator.tsx": "Calculates BMI from height and weight and shows category and value with simple validation.",
  "frontend/src/components/tools/utilities/EmiCalculator.tsx": "A React EMI calculator that computes monthly payments, total amount, and interest based on user inputs.",
  "frontend/src/components/tools/utilities/UnitConverter.tsx": "A unit conversion tool supporting length, weight, and temperature conversions with dynamic unit selection.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and identity lifecycle management.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables, dark mode styles, and utility classes.",
  "frontend/src/lib/clipboard.ts": "Utility function to copy text to the clipboard using modern API with a fallback for older browsers.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/HomePage.tsx": "Home page assembling major site sections and injecting SEO structured data.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page describing data practices with styled sections and icons.",
  "frontend/src/pages/tools/AgeCalculatorPage.tsx": "Lazy-loads the Age Calculator tool and renders it within a generic tool page layout with SEO content.",
  "frontend/src/pages/tools/AttendanceCalculatorPage.tsx": "Page wrapper that loads the AttendanceCalculator component and passes SEO metadata into ToolPageLayout.",
  "frontend/src/pages/tools/BmiCalculatorPage.tsx": "Loads the BMI calculator tool and renders it within ToolPageLayout with BMI-specific SEO content.",
  "frontend/src/pages/tools/CareerRoadmapGeneratorPage.tsx": "Hosts the AI career roadmap generator with a form and timeline, managing roadmap state and SEO content.",
  "frontend/src/pages/tools/CgpaCalculatorPage.tsx": "Page for the CGPA/SGPA calculator, lazily loading the component and supplying CGPA-specific SEO config.",
  "frontend/src/pages/tools/EmiCalculatorPage.tsx": "Displays the EMI calculator tool within ToolPageLayout using its SEO text and lazy-loaded component.",
  "frontend/src/pages/tools/InternshipEmailTemplatePage.tsx": "Renders the internship email template generator tool with corresponding SEO content.",
  "frontend/src/pages/tools/InterviewPrepChecklistPage.tsx": "Loads and displays the interview preparation checklist tool inside the shared layout.",
  "frontend/src/pages/tools/LinkedinProfileChecklistPage.tsx": "Displays the LinkedIn profile checklist tool using ToolPageLayout and its SEO info.",
  "frontend/src/pages/tools/ResumeBulletGeneratorPage.tsx": "Shows the resume bullet generator tool with related SEO content in the shared layout.",
  "frontend/src/pages/tools/SgpaCalculatorPage.tsx": "Page for the SGPA calculator using the shared CGPA/SGPA calculator component and SGPA SEO metadata.",
  "frontend/src/pages/tools/ToolPageLayout.tsx": "Reusable layout that renders tool pages with headings, tool components, SEO content, FAQs, and structured data.",
  "frontend/src/pages/tools/UnitConverterPage.tsx": "Loads and displays the unit converter tool with its SEO configuration.",
  "frontend/src/routes/Router.tsx": "Defines the app's routing structure, lazy-loads tool pages, and sets up the root layout with theme, navigation, and suspense.",
  "frontend/src/seo/content/age.ts": "Provides age calculator SEO content sections and FAQs including descriptions, use cases, and manual calculation steps.",
  "frontend/src/seo/content/attendance.ts": "Provides SEO content explaining attendance percentage, calculation steps, university rules, and tips for maintaining required attendance with references to related tools.",
  "frontend/src/seo/content/bmi.ts": "Defines BMI educational content covering what BMI is, how to calculate it, its limitations, and includes FAQs for health-related guidance.",
  "frontend/src/seo/content/careerRoadmap.ts": "Contains detailed SEO text describing career roadmaps, how the AI generator works, and popular career paths for engineering students.",
  "frontend/src/seo/content/cgpa.ts": "Includes CGPA explanations, calculation formulas, conversion methods, and step‑by‑step guidance for tracking academic performance.",
  "frontend/src/seo/content/emi.ts": "Provides EMI-related content covering EMI basics, calculation formulas, education‑loan specifics, repayment tips, and FAQs.",
  "frontend/src/seo/content/internshipEmail.ts": "Defines SEO content sections explaining cold emailing for internships, how to write effective internship emails, and how to find companies and contacts.",
  "frontend/src/seo/content/interviewPrep.ts": "Provides structured interview preparation content covering technical, behavioral, and interview-day best practices for students.",
  "frontend/src/seo/content/linkedinChecklist.ts": "Contains LinkedIn optimization guidance for students, detailing profile sections, skills, endorsements, and recommendations.",
  "frontend/src/seo/content/resumeBullets.ts": "Offers guidance on writing effective resume bullet points, including formulas, examples, section-specific tips, and common mistakes.",
  "frontend/src/seo/content/sgpa.ts": "Defines SGPA-related content explaining what SGPA is, how to calculate it, step-by-step guides, and conversion to percentage.",
  "frontend/src/seo/content/unitConverter.ts": "Defines SEO content sections and FAQ items for the Unit Converter tool, including explanations, common conversions, and student-focused guidance.",
  "frontend/src/seo/HeadTags.tsx": "Dynamically updates document title, meta tags, Open Graph, Twitter cards, and canonical URL based on the current route.",
  "frontend/src/seo/jsonld.ts": "Provides functions to generate JSON-LD schemas for web apps, breadcrumbs, and FAQ pages using site configuration data.",
  "frontend/src/seo/seoRoutes.ts": "Exports SEO metadata for each route, including titles, descriptions, keywords, and canonical paths for major site pages.",
  "frontend/src/seo/siteConfig.ts": "Stores global SEO config and returns the site base URL depending on environment, with defaults for production and development.",
  "frontend/src/seo/StructuredData.tsx": "Injects JSON-LD structured data scripts into the DOM for SEO.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project’s static-site architecture, goals, known issues, and existing features for the Student Hub build."
}