{
  "kind": "build_request",
  "title": "Improve career roadmap quality and add an ATS-friendly Resume Generator tool",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-68",
      "text": "Improve the deterministic career roadmap content so the generated roadmaps are more realistic, career-relevant, and free of irrelevant or misleading technology references.\n\nSpecifically update the roadmap template data used by `getRoadmapTemplate(...)` so that:\n- Roadmaps do not mention unsupported stack/deployment items (e.g., AWS/Vercel, MongoDB, Node/Express) as required steps unless they are clearly optional and career-appropriate.\n- Learning phases, topics, and resources are tailored to the selected career (or at least to its category) and remain consistent with Indian student/fresher context.\n- The roadmap output remains fully deterministic (no external API/AI calls) and continues to render via the existing Roadmap UI components without breaking layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make proper road maps."
        ]
      },
      "acceptanceCriteria": [
        "For multiple sampled careers across different categories (e.g., Frontend Developer, Data Analyst, Cybersecurity Analyst, UI Designer), the generated phases/topics/resources are career-appropriate and not generic filler.",
        "Roadmaps no longer include obviously mismatched requirements like AWS/Vercel deployment or MongoDB/Node as mandatory steps for every technology career category.",
        "No external calls are added; roadmap generation remains deterministic and purely local.",
        "Existing roadmap pages/sections (homepage section and /career-roadmap-generator) continue to function and render without runtime errors."
      ]
    },
    {
      "id": "REQ-69",
      "text": "Add a new ATS-friendly Resume Generator tool as a dedicated tool page/route.\n\nThe tool must:\n- Be a step-by-step wizard (not a single long form) covering key resume sections: Contact, Summary, Skills (hard + soft), Experience (with action-verb and metrics prompts), Education, Certifications, Projects, and Keywords.\n- Generate a clean, ATS-friendly, single-column resume output preview from the collected inputs.\n- Provide export options: (1) copy the full resume as plain text to clipboard and (2) download the resume as a .txt file.\n- Use clear English for all labels, helper text, and outputs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add make real are good ATS resume."
        ]
      },
      "acceptanceCriteria": [
        "A new dedicated route exists for the ATS Resume Generator and loads successfully without blank/white-screen issues.",
        "The UI is a multi-step wizard with next/back navigation and clearly separated sections (Contact, Summary, Skills, Experience, Education, Certifications, Projects, Keywords).",
        "The tool produces a single-column ATS-friendly preview (no tables, no multi-column formatting in the generated output).",
        "Users can copy the full resume output as plain text to clipboard successfully.",
        "Users can download the resume as a .txt file containing the same content as the preview/output."
      ]
    },
    {
      "id": "REQ-70",
      "text": "Integrate the new ATS Resume Generator into the existing navigation entry points for resume tools.\n\nAdd a new tool card in the existing \"Resume & Placement Help\" section that navigates to the new ATS Resume Generator dedicated page/route (do not open it in the existing modal), while keeping the existing four resume tool cards unchanged and still modal-based.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add make real are good ATS resume."
        ]
      },
      "acceptanceCriteria": [
        "The Resume & Placement Help section shows an additional tool card for the ATS Resume Generator.",
        "Clicking the new card navigates to the dedicated ATS Resume Generator route (full page), not a modal.",
        "The existing four tools (Resume Bullet Generator, Internship Email Template, Interview Prep Checklist, LinkedIn Profile Checklist) still open in the modal and behave as before."
      ]
    },
    {
      "id": "REQ-71",
      "text": "Add SEO + routing configuration for the ATS Resume Generator page so it participates in the existing SEO system and technical SEO assets.\n\nUpdate:\n- TanStack Router to register the new page route (lazy-loaded like other tool pages).\n- `frontend/src/seo/seoRoutes.ts` to include metadata (title, description, keywords, canonicalPath) for the new route.\n- `frontend/public/sitemap.xml` to include the new URL so it is discoverable by search engines.\n\nEnsure user-facing SEO strings are in clear English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add make real are good ATS resume."
        ]
      },
      "acceptanceCriteria": [
        "The ATS Resume Generator route is registered in the router and is code-split/lazy-loaded similar to other tool routes.",
        "`seoRoutes` contains an entry for the new ATS Resume Generator path with title/description/keywords/canonicalPath.",
        "`sitemap.xml` includes the new ATS Resume Generator URL entry.",
        "The new page renders HeadTags + StructuredData the same way other tool pages do (no layout impact)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not add or require any login/authentication flows (including Internet Identity) anywhere in the UI.",
    "All roadmap and resume generation must be deterministic and run locally in the browser (no external AI/API calls).",
    "Preserve the existing design system (Tailwind + shadcn components, card styling, spacing) and avoid disruptive layout changes.",
    "Backend remains a minimal single-actor Motoko canister; do not introduce backend dependencies for these features."
  ],
  "nonGoals": [
    "Do not implement PDF/DOCX export for the ATS resume (TXT + clipboard only).",
    "Do not add third-party resume parsing/scoring/ATS-checker integrations.",
    "Do not redesign unrelated homepage sections or existing tools beyond what is needed to add the new tool card and improve roadmap content."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}