{
  "kind": "build_request",
  "title": "Add standalone ATS-friendly resume generator wizard tool (new route)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-54",
      "text": "Create a new standalone ATS-friendly Resume Generator tool as its own dedicated route/page in the existing TanStack Router setup, implemented as a step-by-step wizard (not a single form) that covers all key resume sections: Contact details, Professional summary, Skills (hard + soft), Work experience (ATS action verbs + metrics prompts), Education, Certifications, Projects, and Keyword suggestions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "B . replace using caffeine.ai with for Indian Students"
        ]
      },
      "acceptanceCriteria": [
        "A new dedicated page/route exists for the ATS Resume Generator tool and renders without runtime errors.",
        "The tool UI is a step-by-step wizard with clear navigation (e.g., Next/Back) and does not require login.",
        "Wizard steps include inputs for: Contact, Summary, Skills, Experience, Education, Certifications, Projects, and Keyword suggestions.",
        "All inputs have basic validation and clear labels; the page remains mobile-friendly and consistent with the existing design system (Tailwind + shadcn)."
      ]
    },
    {
      "id": "REQ-55",
      "text": "On the ATS Resume Generator page, generate an ATS-friendly, single-column resume output preview from the wizard inputs and provide one-click export options: (1) copy the full resume as plain text to clipboard and (2) download the resume as a .txt file.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "make a ats friends resume generator proper one with every key of aspect"
        ]
      },
      "acceptanceCriteria": [
        "The generated resume output is plain, ATS-friendly text (no tables, no multi-column formatting) and updates based on the wizard inputs.",
        "A \"Copy\" action copies the full resume text to clipboard using the existing clipboard utility pattern.",
        "A \"Download\" action downloads a .txt file containing the full resume text.",
        "Export actions work in modern browsers and do not require any backend calls."
      ]
    },
    {
      "id": "REQ-56",
      "text": "Integrate the ATS Resume Generator page into the existing SEO and routing system: register the new route in the router, add an entry in the SEO route metadata configuration (title/description/keywords/canonicalPath), and include the new URL in the static sitemap.xml.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "2"
        ]
      },
      "acceptanceCriteria": [
        "The new ATS Resume Generator route is registered in frontend/src/routes/Router.tsx using the same lazy-loading/Suspense approach as other tool pages.",
        "The new route has an SEO metadata entry in frontend/src/seo/seoRoutes.ts so HeadTags sets title/meta/canonical correctly.",
        "frontend/public/sitemap.xml includes the new ATS Resume Generator URL with appropriate changefreq/priority consistent with other tool routes.",
        "Navigating directly to the new URL loads the page and shows correct SEO title/description in the document head."
      ]
    },
    {
      "id": "REQ-57",
      "text": "Add an entry point to access the new ATS Resume Generator from the existing UI by adding a new tool card in the \"Resume & Placement Help\" section that opens the ATS Resume Generator in a dedicated page/route (not in a modal), while keeping the existing four resume tool cards unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "I will create a stand‑alone ATS‑friendly resume generator tool for your website. It will appear as its own page"
        ]
      },
      "acceptanceCriteria": [
        "The Resume & Placement Help section shows an additional tool card for the ATS Resume Generator.",
        "Clicking the ATS Resume Generator card navigates to the dedicated ATS Resume Generator route (full page).",
        "The existing four tools (Resume Bullet Generator, Internship Email Template, Interview Prep Checklist, LinkedIn Profile Checklist) continue to open in the current modal behavior unchanged.",
        "The new card matches the existing styling and responsive grid behavior."
      ]
    }
  ],
  "constraints": [
    "Do not add or require any login/authentication flow (including Internet Identity) for the ATS Resume Generator.",
    "Do not introduce backend dependencies; all resume generation must be performed locally in the browser.",
    "Do not edit any files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Keep the project within the existing React + TypeScript + Tailwind + shadcn + React Query stack."
  ],
  "nonGoals": [
    "Do not generate or download PDF/DOCX files; limit export to plain text copy and .txt download.",
    "Do not integrate external AI/LLM services or make network calls for resume generation or keyword suggestions.",
    "Do not change the existing footer layout/design beyond what is required by already-tracked footer credit text changes.",
    "Do not add new third-party authentication, analytics, or databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}