{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Deterministic roadmap improvements + ATS-friendly resume generator tool",
  "requirements": [
    {
      "id": "REQ-68",
      "summary": "Improve deterministic career roadmap template data to be career-appropriate, realistic for Indian freshers, and free of irrelevant mandatory tech references.",
      "acceptanceCriteria": [
        "For multiple sampled careers across different categories (e.g., Frontend Developer, Data Analyst, Cybersecurity Analyst, UI Designer), the generated phases/topics/resources are career-appropriate and not generic filler.",
        "Roadmaps no longer include obviously mismatched requirements like AWS/Vercel deployment or MongoDB/Node as mandatory steps for every technology career category.",
        "No external calls are added; roadmap generation remains deterministic and purely local.",
        "Existing roadmap pages/sections (homepage section and /career-roadmap-generator) continue to function and render without runtime errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/roadmap/roadmapTemplates.ts",
          "operation": "modify",
          "description": "Revise the template data used by getRoadmapTemplate(...) to better align phases/topics/resources with each career category (and selected high-traffic careers), remove or demote unsupported stack/deployment items (e.g., AWS/Vercel, MongoDB, Node/Express) from being mandatory, and keep all output deterministic and compatible with existing Roadmap UI rendering. Use the existing Tailwind + shadcn-ui design patterns already consumed by the Roadmap UI components; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-69",
      "summary": "Create a dedicated ATS-friendly Resume Generator tool page with a step-by-step wizard, ATS preview, and TXT/clipboard exports.",
      "acceptanceCriteria": [
        "A new dedicated route exists for the ATS Resume Generator and loads successfully without blank/white-screen issues.",
        "The UI is a multi-step wizard with next/back navigation and clearly separated sections (Contact, Summary, Skills, Experience, Education, Certifications, Projects, Keywords).",
        "The tool produces a single-column ATS-friendly preview (no tables, no multi-column formatting in the generated output).",
        "Users can copy the full resume output as plain text to clipboard successfully.",
        "Users can download the resume as a .txt file containing the same content as the preview/output."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/tools/resume/AtsResumeGenerator.tsx",
          "operation": "create",
          "description": "Implement the ATS Resume Generator as a multi-step wizard component (local state only) that collects the required sections and produces a deterministic, single-column plain-text resume preview. Use shadcn-ui components (e.g., Card, Button, Input, Textarea, Separator/Badge/Alert as appropriate) to match existing design system; verify the component's usage instructions before implementing. Use frontend/src/lib/clipboard.ts for copy-to-clipboard support, and generate a .txt download via browser APIs (no backend, no external calls)."
        },
        {
          "path": "frontend/src/pages/tools/AtsResumeGeneratorPage.tsx",
          "operation": "create",
          "description": "Add a dedicated tool page that renders the ATS Resume Generator within the existing ToolPageLayout so it includes the standard SEO structured data behavior and consistent spacing/typography. Use shadcn-ui styling conventions used across other tool pages; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/seo/content/atsResume.ts",
          "operation": "create",
          "description": "Create SEO content + FAQs for the ATS Resume Generator page (clear English) following the same ContentSection/FAQItem pattern as existing tool SEO content files. Keep guidance focused on ATS-friendly single-column text resumes and student/fresher context. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-70",
      "summary": "Add a new tool card in Resume & Placement Help that navigates to the ATS Resume Generator page while keeping existing four tools modal-based.",
      "acceptanceCriteria": [
        "The Resume & Placement Help section shows an additional tool card for the ATS Resume Generator.",
        "Clicking the new card navigates to the dedicated ATS Resume Generator route (full page), not a modal.",
        "The existing four tools (Resume Bullet Generator, Internship Email Template, Interview Prep Checklist, LinkedIn Profile Checklist) still open in the modal and behave as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ResumePlacementSection.tsx",
          "operation": "modify",
          "description": "Add an additional card for the ATS Resume Generator that uses TanStack Router navigation to go to the dedicated route (not the existing modal flow). Keep the existing four cards unchanged and still opening the dialog with the existing tool components. Maintain current Tailwind + shadcn-ui Card styling and interaction patterns; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-71",
      "summary": "Register ATS Resume Generator route and add SEO metadata + sitemap entry to integrate with existing technical SEO system.",
      "acceptanceCriteria": [
        "The ATS Resume Generator route is registered in the router and is code-split/lazy-loaded similar to other tool routes.",
        "`seoRoutes` contains an entry for the new ATS Resume Generator path with title/description/keywords/canonicalPath.",
        "`sitemap.xml` includes the new ATS Resume Generator URL entry.",
        "The new page renders HeadTags + StructuredData the same way other tool pages do (no layout impact)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/routes/Router.tsx",
          "operation": "modify",
          "description": "Register a new lazy-loaded tool page route for the ATS Resume Generator (consistent with existing tool route patterns) and ensure it renders through the existing RootLayout (HeadTags/StickyNavbar/Footer/Toaster) without introducing any authentication flow. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/seo/seoRoutes.ts",
          "operation": "modify",
          "description": "Add a new seoRoutes entry for the ATS Resume Generator path with clear English title/description/keywords and the correct canonicalPath, matching the existing SEO metadata structure. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/public/sitemap.xml",
          "operation": "modify",
          "description": "Add the ATS Resume Generator URL to the sitemap so it is discoverable by search engines, following the existing sitemap formatting and URL conventions."
        }
      ]
    }
  ]
}