{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Privacy Policy page, route wiring, footer link, SEO metadata, and sitemap entry",
  "requirements": [
    {
      "id": "REQ-46",
      "summary": "Create a standalone Privacy Policy page at /privacy-policy with clear English content about local-only calculations, no login, no personal data collection, and third-party ad scripts.",
      "acceptanceCriteria": [
        "Navigating to /privacy-policy renders a non-blank page in the existing site layout (StickyNavbar + Footer).",
        "The Privacy Policy page uses English user-facing text.",
        "The page content explicitly states that the site does not require login and that calculations are performed locally in the browser.",
        "The page includes a note that third-party advertising scripts (Google AdSense) may use cookies/identifiers as applicable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PrivacyPolicyPage.tsx",
          "operation": "create",
          "description": "Add a dedicated Privacy Policy page component with readable, standalone layout and English policy text covering: no login required, no personal data collection, calculations performed locally in the browser, and a clear note about third-party advertising scripts (e.g., Google AdSense) potentially using cookies/identifiers."
        }
      ]
    },
    {
      "id": "REQ-47",
      "summary": "Make the footer Privacy Policy area include a clear clickable link to /privacy-policy while keeping the existing short summary text and design consistency.",
      "acceptanceCriteria": [
        "On the homepage and all tool pages, the footer contains a clearly clickable Privacy Policy link that navigates to /privacy-policy.",
        "The footer layout remains consistent with the current design system (no major visual redesign)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/FooterSection.tsx",
          "operation": "modify",
          "description": "Update the existing Privacy Policy footer section to include a clearly clickable internal navigation link to /privacy-policy (using TanStack Router link utilities), while preserving the current short privacy summary text and overall footer layout/styling."
        }
      ]
    },
    {
      "id": "REQ-48",
      "summary": "Register /privacy-policy in TanStack Router and add English SEO metadata so HeadTags updates title/meta/canonical for the new route with Student Hub branding.",
      "acceptanceCriteria": [
        "The router includes a working /privacy-policy route.",
        "Visiting /privacy-policy updates document title, meta description, and canonical URL via the existing HeadTags mechanism.",
        "The /privacy-policy SEO metadata is in English and consistent with the \"Student Hub\" brand name."
      ],
      "file_operations": [
        {
          "path": "frontend/src/routes/Router.tsx",
          "operation": "modify",
          "description": "Add the /privacy-policy route to the TanStack Router route tree (wire it to the new PrivacyPolicyPage, preferably lazy-loaded like other pages). Also ensure HeadTags receives a reactive pathname from router state (not a one-time window.location.pathname) so title/meta/canonical update on SPA navigation."
        },
        {
          "path": "frontend/src/seo/seoRoutes.ts",
          "operation": "modify",
          "description": "Add a new SEO metadata entry for '/privacy-policy' with English title/description/keywords and canonicalPath '/privacy-policy', keeping naming consistent with the Student Hub brand."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Add /privacy-policy to the static sitemap.xml so search engines can discover it while keeping robots.txt valid and still referencing the sitemap.",
      "acceptanceCriteria": [
        "frontend/public/sitemap.xml contains an additional <url> entry for https://studenthub.com/privacy-policy with reasonable changefreq/priority consistent with other informational pages.",
        "robots.txt remains valid and continues to reference the sitemap URL."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sitemap.xml",
          "operation": "modify",
          "description": "Add a new <url> entry for https://studenthub.com/privacy-policy using changefreq/priority values consistent with other informational pages in the sitemap; do not remove or alter existing URLs."
        }
      ]
    }
  ]
}